In [2]:
import pandas as pd
import numpy as np

In [3]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=["ohio","colorado","utah","new york"],columns=["one","two","three","four"])

In [4]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [5]:
data["one"]

ohio         0
colorado     4
utah         8
new york    12
Name: one, dtype: int32

In [7]:
data[["one","two"]]

          one  two
ohio        0    1
colorado    4    5
utah        8    9
new york   12   13

In [8]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [9]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new york  False  False  False  False

In [10]:
data[data<5]=0

In [11]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [12]:
arr=np.random.randn(4,4)

In [14]:
arr>0

array([[ True, False, False,  True],
       [False, False,  True,  True],
       [ True, False,  True, False],
       [False, False, False, False]])

In [15]:
arr[arr>0]=1

In [16]:
arr

array([[ 1.        , -0.95875216, -0.86318657,  1.        ],
       [-0.68747923, -2.00263865,  1.        ,  1.        ],
       [ 1.        , -0.45590976,  1.        , -0.62229576],
       [-1.24805081, -1.94737891, -0.67116821, -0.27828776]])

In [17]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [20]:
data.loc[["ohio","utah"],["one","three"]]

      one  three
ohio    0      0
utah    8     10

In [21]:
data.iloc[[0,1,3],[0,2,3]]

          one  three  four
ohio        0      0     0
colorado    0      6     7
new york   12     14    15

In [22]:
data.loc[:"utah",:"three"]

          one  two  three
ohio        0    0      0
colorado    0    5      6
utah        8    9     10

In [23]:
data.iloc[:3,:3]

          one  two  three
ohio        0    0      0
colorado    0    5      6
utah        8    9     10

In [24]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [26]:
data.loc["ohio":,"two":]

          two  three  four
ohio        0      0     0
colorado    5      6     7
utah        9     10    11
new york   13     14    15

In [28]:
s1=pd.Series([7.2,-2.5,3.6,1.5],index=["a","b","c","d"])

In [29]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])

In [30]:
s1

a    7.2
b   -2.5
c    3.6
d    1.5
dtype: float64

In [31]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [32]:
s1+s2

a    5.1
b    NaN
c    7.2
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [33]:
df1=pd.DataFrame(np.arange(9).reshape((3,3)),index=["ohio","texas","colorado"],columns=list("abc"))

In [34]:
df2=pd.DataFrame(np.arange(12).reshape((4,3)),index=["utah","ohio","texas","oregon"],columns=list("bde"))

In [35]:
df1

          a  b  c
ohio      0  1  2
texas     3  4  5
colorado  6  7  8

In [36]:
df2

        b   d   e
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oregon  9  10  11

In [37]:
df1+df2

           a     b   c   d   e
colorado NaN   NaN NaN NaN NaN
ohio     NaN   4.0 NaN NaN NaN
oregon   NaN   NaN NaN NaN NaN
texas    NaN  10.0 NaN NaN NaN
utah     NaN   NaN NaN NaN NaN

In [38]:
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list('abcd'))

In [40]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list("abcde"))

In [41]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [42]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [43]:
df2.loc[1,"b"]=np.nan

In [44]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [45]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [47]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [48]:
df1/2

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [49]:
df1*2

    a   b   c   d
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22

In [50]:
df1**2

    a   b    c    d
0   0   1    4    9
1  16  25   36   49
2  64  81  100  121

In [51]:
df1>1

       a      b     c     d
0  False  False  True  True
1   True   True  True  True
2   True   True  True  True

In [52]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [53]:
df1-df2

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0  NaN -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [54]:
df1*df2

      a     b      c      d   e
0   0.0   1.0    4.0    9.0 NaN
1  20.0   NaN   42.0   56.0 NaN
2  80.0  99.0  120.0  143.0 NaN
3   NaN   NaN    NaN    NaN NaN

In [58]:
df1/df2

     a         b         c         d   e
0  NaN  1.000000  1.000000  1.000000 NaN
1  0.8       NaN  0.857143  0.875000 NaN
2  0.8  0.818182  0.833333  0.846154 NaN
3  NaN       NaN       NaN       NaN NaN

In [59]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),index=["utah","ohio","texas","oregon"],columns=list("abc"))

In [60]:
frame

        a   b   c
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oregon  9  10  11

In [61]:
series=frame.iloc[0]

In [62]:
series

a    0
b    1
c    2
Name: utah, dtype: int32

In [65]:
frame-series["a":"b"]

          a    b   c
utah    0.0  0.0 NaN
ohio    3.0  3.0 NaN
texas   6.0  6.0 NaN
oregon  9.0  9.0 NaN

In [66]:
series2=pd.Series(range(3),index=list("bef"))

In [67]:
series2

b    0
e    1
f    2
dtype: int64

In [68]:
frame+series2

         a     b   c   e   f
utah   NaN   1.0 NaN NaN NaN
ohio   NaN   4.0 NaN NaN NaN
texas  NaN   7.0 NaN NaN NaN
oregon NaN  10.0 NaN NaN NaN

In [70]:
frame

        a   b   c
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oregon  9  10  11

In [71]:
series3=frame["b"]

In [72]:
series3

utah       1
ohio       4
texas      7
oregon    10
Name: b, dtype: int32

In [74]:
frame.sub(series3,axis="index")

        a  b  c
utah   -1  0  1
ohio   -1  0  1
texas  -1  0  1
oregon -1  0  1

In [75]:
frame=pd.DataFrame(np.random.randn(4,3),index=["utah","ohio","texas","oregon"],columns=list("bde"))

In [76]:
frame

               b         d         e
utah   -0.809786 -0.527467 -0.701848
ohio    1.442935 -2.852293  1.511735
texas  -0.514744  2.019395 -0.415609
oregon -0.773149 -0.193692 -0.148348

In [77]:
np.abs(frame)

               b         d         e
utah    0.809786  0.527467  0.701848
ohio    1.442935  2.852293  1.511735
texas   0.514744  2.019395  0.415609
oregon  0.773149  0.193692  0.148348